tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# All in one for **env
brew "anyenv"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Console Matrix
brew "cmatrix"
# Load/unload environment variables based on $PWD
brew "direnv"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Remote repository management made easy
brew "ghq"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Simplistic interactive filtering tool
brew "peco"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
cask "adoptopenjdk"
# Tools for building Android applications
cask "android-studio"
# Clipboard extension app
cask "clipy"
cask "cmd-eikana"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "figma"
# Web browser
cask "firefox"
# Shows hidden files and folders and switches their visibility in Finder
cask "funter"
# Web browser
cask "google-chrome"
cask "google-japanese-ime"
cask "gyazo"
# Terminal built on web technologies
cask "hyper"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Interface for reading and syncing eBooks
cask "kindle"
# Visual user interface for Docker Container management
cask "kitematic"
cask "psequel"
# MySQL/MariaDB database management platform
cask "sequel-pro"
cask "teamsql"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
mas "1Password 7", id: 1333542190
mas "Alfred", id: 405843582
mas "CopyClip", id: 595191960
mas "GarageBand", id: 682658836
mas "HiddenMe", id: 467040476
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
